/*******************************************************************************
* 文 件 名: cpulib_def.h
* 创 建 者: Keda Huang
* 版    本: V1.0
* 创建日期: 2016-08-23
* 文件说明: CPU公共库的宏定义
*******************************************************************************/

#ifndef __CPULIB_DEF_H
#define __CPULIB_DEF_H

/* 头文件 --------------------------------------------------------------------*/
#include "cpu_port.h"

/* 调试宏 --------------------------------------------------------------------*/
#define debug_assert(expr)      CPU_Assert(expr)
#define debug_printf(...)       CPU_Printf(__VA_ARGS__)

#endif  /* __CPULIB_DEF_H */
